import java.util.Scanner;

public class Question {
    public static void main(String[] args) {
//        문제1) 점수를 입력받아 점수 및 등급을 출력하는 프로그램을 작성하세요
//        else if 문을 사용하여 작성
//        95이상 = A+, 90이상 = A, 85이상 = B+, 80이상 = B, 75이상 = C+, 70이상 = C, 60이상 = D, 60미만 = F
//        중첩 if 문을 사용하여 각각의 + 대의 점수를 출력


//      1번 문제
//        두 정수를 입력받아 합을 구하여 출력하는 프로그램을 작성하라. 키보드 입력은 Scanner 클래스를 이용하라
//        두 정수를 입력하세요>> 10 20
//        10 + 20은 30

//      2번 문제
//        한 층의 높이가 5m일 때, 건물이 몇 층인지 입력받아 높이를 출력하라.
//        몇 층인지 입력하세요>>155
//        775m 입니다

//      3번 문제
//        x 값을 입력받아 y = x²-3x+7 식을 계산하여 y값을 출력하는 프로그램을 작성하라
//        x 값을 입력하세요>> 5
//        x=5, y=17

//      4번 문제
//        2차원 평면에서 하나의 직사각형은 두 점으로 표현된다. (50, 50)과 (100, 100)의 두점으로 이루어진
//        사각형이 있다고 하자. 한 점을 구성하는 정수 x와 y값을 입력받고 점 (x,y)가 이 직사각형 안에 있는지를
//        판별하는 프로그램을 작성하라
//        점 (x,y)의 좌표를 입력하세요>>60 70
//        점 (60,70)은 (50,50)과 (100,100)의 사각형 내에 있습니다

//      5번 문제
//        다음과 같이 AND와 OR의 논리 연산을 입력받아 결과를 출력하는 프로그램을 작성하라
//        예를들어 'true AND false'의 결과르 false를, 'true OR false'의 결과로
//        true를 출력하면 된다. if 문 대신 switch 문을 이용하라
//        논리 연산을 입력하세요>>true OR false
//        true


//      6번 문제
//        돈의 액수를 입력받아 오만원권, 만원건, 천원권, 500원짜리 동전, 100원짜리 동전, 10원짜리 동전, 1원짜리 동전
//        각 몇개로 변환되는지 출력하라.
//        돈의 액수를 입력하세요>>65245
//        오만원건1개, 만원1개, 천원5개, 500원0개, 100원2개, 10원4개, 1원5개


//      7번 문제
//        학점이 A, B이면, "Excellent", 학점이 C,D이면 "Good", 학점이 F이면 "Bye"라고
//        출력하는 프로그램을 작성하라. switch와 break를 활용하라
//        학점을 입력하세요>>B
//        Excellent



//      9번 문제
//        369게임의 일부를 작성해보자. 1~99까지의 정수를 입력받고 수에 3, 6, 9 중 하나가 있는 경우는 "박수짝"
//        두 개 있는 경우는 "박수짝짝", 하나도 없으면 "박수없음"을 출력하는 프로그램을 작성하라. 예를 들면,
//        13인 경우 "박수짝", 36인 경우 "박수짝짝", 5인 경우 "박수없음"을 출력하면 된다.
//        1~99 사이의 정수를 입력하세요>>36
//        박수짝짝





//        가위바위보 게임
//        두 사람이 하는 가위바위보 게임을 만들어보자. 두 사람의 이름은 '철수'와 '영희'이다. 먼저"철수"를 출력하고
//        "가위", "바위", "보" 중 하나를 문자열로 입력받는다. "영희"에 대해서 마찬가지 방법으로 입력받는다.
//        두 사람으로부터 문자열을 입력받은 후 누가 이겼는지 판별하여 승자를 출력한다.
//        가위 바위 보게임입니다. 가위, 바위, 보 중에서 입력하세요
//        철수 >> 가위
//        영희 >> 보
//        철수가 이겼습니다.




    }
}